<!DOCTYPE html>
<html lang="es">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Elementos Multimedia</title>
    <link rel="shortcut icon" type="image/x-icon" href="https://i.imgur.com/pIPAoQz.png">
	<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>

	<h1>Elementos Multimedia</h1>

	<hr>

    <div class="container">

        <p><b>Etimol&oacute;gicamente</b>, la palabra multimedia significa <b>"m&uacute;ltiples intermediarios"</b> y para el contexto de las tecnilog&iacute;as de la informaci&oacute;n, hace referencia a que existen <b>m&uacute;ltiples intermediarios</b> entre la fuente y el destino de la informaci&oacute;n, es decir, que se utilizan <b>diversos medios</b> para almacenar, transmitir o mostrar la informaci&oacute;n.</p>

        <p><b>Algunos autores definen el termino multimedia como:</b></p>

        <p>Integraci&oacute;n de <b>dos o m&aacute;s medios de comunicaci&oacute;n</b> que pueden ser controlados o manipulados por el usuario mediante el ordenador; <b>video, texto, gr&aacute;ficos, audio y animaci&oacute;n</b> controlada con ordenador; combinaci&oacute;n de hardware, sofrware y tecnolog&iacute;as de almacenamiento incorporadas para proveer un ambiente de informaci&oacute;n multisensorial <b>(Galbreath, 1992).</b></p>

        <p>Uso de <b>texto, sonido y video</b> para presentar informaci&oacute;n; hace que la informaci&oacute;n cobre vida <b>(Jam&aacute;s, 1993).</b></p>

        <p>En 1968, <b>Douglas Engelbart</b> propone en la descripci&oacute;n de NLS (oNLine System- Sistema en l&iacute;nea) <b>un sistema en donde no se procesan datos</b> como n&uacute;meros sino ideas como texto estructurado y gr&aacute;fico, dando mayor flexibilidad a manejar s&iacute;mbolos de manera natural, que forzar la reducci&oacute;n de ideas a formas lineales como ser&iacute;a el texto impreso, esto formo un <b>antecedente a lo que llamamos multimedios</b> adem&aacute;s de que cambio el paradigma de que las computadoras son simples procesadoras de datos a considerarlas como administradoras de informaci&oacute;n.</p>

        <p><b>La Miltimedia se inicia en 1984</b>, en ese a&ntilde;o, Apple Computer lanz&oacute; la Macintosh, la primera computadora con amplias capacidades de reproducci&oacute;n de sonidos equivalentes a los de un buen radio AM, esta caracter&iacute;stica, unida a que su sistema operativo y programas se desarrollaron, en la forma que ahora se conocen momo ambiente Windows, fue propicio para el dise&ntilde;o gr&aacute;fico y la edici&oacute;n , haciendo de la Macintosh la primera posibilidad de lo que se conoce como <b>Multimedia (PC WORLD, No.119, 1993, 23)</b>.</p>

        <p>El <b>ambiente interactivo</b> inici&oacute; su desarrollo con las nuevas <b>tecnolog&iacute;as de la informaci&oacute;n y la comunicaci&oacute;n</b>, muy concretamente, en el &aacute;mbito de los juegos de video, a partir de 1987 se comenz&oacute; con juegos de video operados por monedas y software de computadoras de entretenimiento <b>(PC WORLD No.115, p.40)</b>.</p>

        <p><b>La tecnolog&iacute;a de multimedia</b> toma auge en los video juegos, a partir de 1992, cuando se integran: <b>audio, video, gr&aacute;ficas, animaci&oacute;n y texto al mismo tiempo</b>, la principal idea multimedia desarrollada en los video juegos es, que se pueda navegar y buscar la informaci&oacute;n que se desea sobre un tema, sin tener que recorrer todo el programa, que se pueda <b>interactuar con la computadora</b> y que la informaci&oacute;n no sea lineal sino asociativa <b>(PC WORLD, 119, 1993,25)</b>.</p>

        <p>El termino multimedia se acu&ntilde;o a finales de los 80 y principios de los 90 para referirse a los ordenadores capaces de trabajar a la vez con varios medios para transmitir la informaci&oacute;n como lo es el <b>sonido, texto, animaciones, video, im&aacute;genes, m&uacute;sica y gr&aacute;ficos</b>.</p>

        <p>La Real Academia Espa&ntilde;ola define el termino de Multimedia como: adj. Que utiliza conjunta y simult&aacute;neamente diversos medios, como <b>im&aacute;genes, sonidos y texto</b>, en la transmisi&oacute;n de una informaci&oacute;n.</p>

        <p>En base a lo anterior, podemos decir que Multimedia es la integraci&oacute;n de dos a m&aacute;s medios distintos en un ordenador personal, estos medios pueden ser, <b>una imagen, gr&aacute;ficos, texto, voz, m&uacute;sica, animaci&oacute;n o video</b>, presentados bajo un mismo enterono con el fin &uacute;nico de transmitir informaci&oacute;n.</p>

        <p>El tipo de informaci&oacute;n multimedia que podemos encontrar se detalla a continuaci&oacute;n:</p>

        <ul type="disc">
            <li><b>Texto:</b> Sin formatear, formateado, lineal e hipertexto.</li>
            <li><b>Gr&aacute;ficos:</b> Utilizados para representar esquemas, planos, dibujos lineales, etc.</li>
            <li><b>Im&aacute;genes:</b> Son documentos formados por p&iacute;xeles.</li>
            <li><b>Animaci&oacute;n:</b> Presentaci&oacute;n de un n&uacute;mero de gr&aacute;ficos por segundo que genera en el observador la sensaci&oacute;n de movimiento.</li>
            <li><b>V&iacute;deo:</b> Presentaci&oacute;n de un n&uacute;mero de im&aacute;genes por segundo, que crean en el observador la sensaci&oacute;n de movimiento.</li>
            <li><b>Sonido:</b> Puede ser el habla, m&uacute;sica u otros sonidos.</li>
        </ul>

    </div>

    <!-- recursos externos a esta pagina -->

    <style>
		@import url('https://fonts.googleapis.com/css2?family=Silkscreen&display=swap');
	</style>
    
</body>
</html>