<!DOCTYPE html>
<html lang="es">
<head>
	<meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
	<title>Servicios de almacenamiento en linea</title>
	<link rel="shortcut icon" type="image/x-icon" href="https://i.imgur.com/pIPAoQz.png">
	<link rel="stylesheet" type="text/css" href="style.css">

</head>
<body style="font-family: 'Silkscreen'">

	<h1>Servicios de almacenamiento en l&iacute;nea</h1>

	<hr>

	<div class="container">

		<p>Desde la antig&uuml;edad la informaci&oacute;n era almacenada, los sumerios utilizaban para ello tablas de arcilla, siendo este un primer <b>sistema de almacenamiento</b>, en la era digial el <b>almacenamiento de datos</b> surge desde mediados del siglo XX con la aparici&oacute;n de las computadoras y unidades de discos duros.</p>

		<p>Los <b>datos digitales</b> han cambiado nuestra forma de almacenar, considerando que se necesita mayor capacidad de espacio y velocidad en los dispositivos de entrada y salida para acceder y recuperar informaci&oacute;n.</p>

		<p>El <b>almacenamiento en l&iacute;nea</b> o tambi&eacute;n llamado <b>almacenamiento en la nube</b>, es un servicio que permite guardar datos transfiri&eacute;ndolos a trav&eacute;s de Internet o de otra red a un sistema de almacenamiento externo que mantiene un tercero.</p>

		<p>Existen cientos de <b>sistemas de almacenamiento en la nube</b> que abarcan desde almacenamiento personal, que guarda o mantiene copias de seguridad de correo electr&oacute;nico, fotos, v&iacute;deos y otros archivos personales de un usuario, que es el diagrama usado en sistemas como una abstracci&oacute;n para determinar la red de internet, mientras que computing implica la inform&aacute;tica. Una buena definici&oacute;n de esto es la que ha formulado el <b>NIST</b> por sus siglas en ingl&eacute;s, <b>National Institute of Standards and Technology</b> (Mell y Grance, 2011; Joyanes Aguilar, 2012), que la considera como:</p>

		<p>hasta <b>almacenamiento empresarioal</b>, que permite a las empresas crear copias de seguridad remota donde la compa&ntilde;&iacute;a puede transferir y almacenar de forma segura archivos de datos o compartirlos entre ubicaciones.</p>

		<p>Existen diversos <b>servicios de almacenamiento en la nube</b>, los cuales permiten acceder a la informaci&oacute;n en tiempo real y aunque todos ellos tienen un plan gratuito, tambi&eacute;n existe la posibilidad de adquirir planes que se ajusten a las necesidades de cada usuario.</p>

		<p>El desarrollo del <b>almacenamiento de datos en la nube</b>, el mejor conocido como <b>cloud computing</b>, se da gracias al uso de equipos virtuales (Furht y Escalante, 2011). El nombre de cloud computing proviene de la utilizaci&oacute;n del s&iacute;mbolo con forma de nube o cloud.</p>

		<p>Un <b>modelo</b> que permite el acceso bajo demanda a trav&eacute;s de la red a un <b>conjunto compartido de recursos</b> de computaci&oacute;n configurables (como por ejemplo red, servidores, almacenamiento, aplicaciones y servicios) que pueden ser r&aacute;pidamente aprovisionados con el m&iacute;nimo esfuerzo de gesti&oacute;n o interacci&oacute;n del proveedor del servicio (Mell y Grance, 2009, citados por Joyanes Aguilar, 2012, p. 91).</p>

		<p>En resumen, un <b>servicio de almacenamiento en nube</b> es un servicio muy pr&aacute;ctico, en donde se pueden hacer copias de seguridad de archivos, audios, fotos, v&iacute;deos y un sinf&iacute;n de materiales digitales e incluso nos da la posibilidad de compartir y trabajar en un mismo documento bajo distintos dispositivos.</p>

		<p>Sin embargo, lo dif&iacute;cil viene a la hora de elegir qu&eacute; servicio de <b>almacenamiento cubre nuestras necesidades</b> y esto depender&aacute; de muchos factores como pueden ser el espacio que requiere, tipo de herramientas extra que prefiera, el precio, la interfaz de trabajo, la posibilidad de trabajar en multiplataformas y dem&aacute;s caracter&iacute;sticas ofrecidas por cada servicio.</p>

		<p>Entre los m&aacute;s destacados <b>servicios de almacenamiento</b> podemos encontrar:</p>

		<ul style="list-style: none;">
			<li>Google Drive</li>
			<li>OneDrive</li>
			<li>pCloud</li>
			<li>Amazon Drive</li>
			<li>Mega</li>
			<li>DropBox</li>
		</ul>

	</div>

	<!-- recursos externos a esta pagina -->

    <style>
		@import url('https://fonts.googleapis.com/css2?family=Silkscreen&display=swap');
	</style>

</body>
</html>