<!DOCTYPE html>
<html lang="es">
<head>
	<meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
	<title>Creaci&oacute;n de un sitio web</title>
	<link rel="shortcut icon" type="image/x-icon" href="https://i.imgur.com/pIPAoQz.png">
	<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body style="font-family: 'Silkscreen'">

	<h1>Creaci&oacute;n de un sitio web</h1>

	<hr>

	<div class="container">

		<p>El 12 de marzo de 1989 el ingl&eacute;s <b>Tim Berners Lee</b> describi&oacute; por primera vez el <b>protocolo de transferencias de hipertextos</b> que dar&iacute;a lugar a la <b>World Wide Web</b> (WWW) y por ende la preaci&oacute;n del <b>primer website</b> de la historia, utilizando tres nuevos recursos: <b>HTML</b> (Lenguaje de Marcas de Hipertexto, del ingl&eacute;s <b>HyperText Markup Language</b>), <b>HTTP</b> (Protocolo de Transferencia de Hipertexto, del ingl&eacute;s <b>Hypertext Transfer Protocol</b>) y un programa llamado <b>Web Browser.</b></p>

		<p>Un a&ntilde;o despues <b>Internet</b> nac&iacute;a de forma cerrada dentro del <b>CERN</b> (sigla provisional utilizada en 1952, que responde al nombre en franc&eacute;s Conseil Europ&eacute;en pour la Rechere Nucl&eacute;aire, es decir, <b>Consejo Europeo para la Investigaci&oacute;n Nuclear</b>) y en agosto de 1991, por fin, los usuarios externos al CERN pudieron <b>Acceder a esa informaci&oacute;n.</b></p>

		<p>en 1991 <b>Tim Berners Lee</b>, subi&oacute; a Internet la <b>primera p&aacute;gina web</b> a trav&eacute;s de su computadora <b>NeXTcube</b>, que tambi&eacute;n fungi&oacute; como el <b>primer servidor del mundo</b> (se encontraba en el CERN y fue puesto en l&iacute;nea el <b>6 de agosto de 1991</b>). &Eacute;sta explicaba el proyecto de la WWW (World Wide Web), y la <b>direcci&oacute;n fue:</b></p>

		<p><u><a href="http://nxoc01.cern.ch/hypertext/WWW/TheProject.html">http://nxoc01.cern.ch/hypertext/WWW/TheProject.html</a></u><br>
		Actualmente ha sido <b>reubicada</b> y puede encontrarse en:</p>

		<p><u><a href="http://www.w3.org/History/19921103-hypertext/hypertext/WWW/TheProject.html">http://www.w3.org/History/19921103-hypertext/hypertext/WWW/TheProject.html</a></u></p>

		<p>La <b>&uacute;nica copia</b> que se conserva de la <b>primera prueba</b> data de <b>noviembre de 1992</b>, muy similar a la original.</p>

		<p>La <b>primera versi&oacute;n de la web</b> consist&iacute;a en p&aacute;ginas <b>HTML</b> editadas manualmente las cuales <b>enlazaban a otras p&aacute;ginas</b> que a menudo eran escritas por personas con intereses comunes.</p>

		<p>Esta <b>primera versi&oacute;n de la web</b> se conoce en la literatura como <b>web 1.0</b> y se extendi&oacute; desde los a&ntilde;os 1990 al 2000.<br>
		En una etapa posterior la web se basa een la generaci&oacute;n de <b>sitios web din&aacute;micos</b> a partir de los datos almacenados en bases de datos.</p>

		<p>En esta etapa no solo el administrador del sitio es capaz de <b>gestionar los contenidos web</b>, sino que el usuario final mediante interacc&iacute;on con formularios tambi&eacute;n puede <b>a&ntilde;adir nuevos contenidos a los ya existentes</b>. En este sentido ha cobrado especial importancia el uso de <b>wikis, blogs y foros</b> de discusi&oacute;n (<b>Fern&aacute;ndez, 2009</b>).</p>

		<p>La <b>World Wide Web</b> creci&oacute; rapidamente, en 1993 solo hab&iacute;a <b>100 World Wide Web Sites</b> y en 1997 ya m&aacute;s de <b>200,000</b> y a partir de entonces sigue la apasionante historia de los <b>sitios web</b> en internet hasta nuestros d&iacute;as.</p>

		<p>Y a todo esto como podemos <b>definir que es un Website. Absari, Farzad. (1998)</b>. Nos menciona que toda la informaci&oacute;n del World Wide est&aacute; <b>organizada por secciones llamadas p&aacute;ginas Web</b>, y donde se guardan los grupos de p&aacute;ginas Web que tienen una relaci&oacute;n entre s&iacute; se les llama <b>Website o sitio Web</b>.</p>

		<p><b>Fern&aacute;ndez, Rafael. (2000)</b>. Nos dice que el <b>Website</b> es una Colecci&oacute;n de p&aacute;ginas Web dotada de una <b>direcci&oacute;n Web &uacute;nica</b>.</p>

		<p>por lo tanto, podemos fefinir que un <b>Website</b>, en espa&ntilde;ol <b>sitio web</b>, es un <b>conjunto de p&aacute;ginas</b> que est&aacute;n agrupadas bajo una direcci&oacute;n web mejor conocida como <b>dominio</b>, obteniendo un <b>nombre &uacute;nico e irrepetible</b> para cada sitio web.</p>

		<p>Para esto se utiliza un <b>dominio de primer nivel</b> o nivel superior, mejor entendido como la <b>extensi&oacute;n de una p&aacute;gina web</b>, por ejemplo: .com, .mx, .org, etc.</p>

		<p>Tambi&eacute;n es necesario un <b>dominio de segundo nivel</b>, el cual representa el nombre de tu sitio web, por ejemplo: <b>misitio</b></p>

		<p>y por &uacute;ltimo existe el <u>dominio de tercer nivel</u> o subdominio el cual se representa como un <b>subnivel del nombre de tu sitio web</b>, por ejemplo: <b>foro.misitio.com</b></p>

		<p>Donde <b>"foro"</b> seria el <b>subdominio</b>, <b>"misitio"</b> seria el <b>dominio de segundo nivel</b> y <b>"com"</b> el <b>dominio de primer nivel</b>.</p>

		<p>Es importante conocer esta estructura, ya que el <b>sitio web</b> que vamos a construir ser&aacute; un <b>subdominio del dominio WWWW</b>, al ser un subdominio nuestro sitio ser&aacute; <b>totalmente gratis</b>, pero <b>con ciertas limitaciones</b>, claro est&aacute; que cualquier persona puede comprar un dominio y de esta forma <b>no tendr&aacute; que depender</b> de los proveedores de <b>sitios web y sus limitaciones.</b></p>

	</div>

	<!-- recursos externos a esta pagina -->

    <style>
		@import url('https://fonts.googleapis.com/css2?family=Silkscreen&display=swap');
	</style>

</body>
</html>